[
  {
    "id": "1",
    "commonName": "Banana Tree",
    "botanicalName": "Musa acuminata, Musa ornata, Musa basjoo",
    "image": "",
    "description": " While these tropical fruiting plants are commonly referred to as trees, they’re technically huge herbaceous plants, as they don’t have a woody stem. Instead, they have fleshy, upright stalks from which large, oblong, bright green leaves grow. Showy flowers appear typically in the spring, giving way to the fleshy, elongated, green or yellow fruit. While most species grow best in warm climates, there also are somewhat cold-hardy banana trees. Plus, they can make good houseplants with enough light, though they typically don't bear fruit indoors.",
    "watering" : "weekly",
    "difficulty": "medium",
    "pets": "dogs",
    "light": "direct" ,
    "flowering": true,
    "size":"large",
    "perennial" : true,
    "care" : "Choosing the right planting site is key to making banana tree care easy. Grow this plant in a location where it will be sheltered from strong winds, as it is very susceptible to damaged leaves. Prepare your planting site by mixing some compost into the soil. And make sure you have enough space for the height and spread of your particular species. During the growing season (spring to fall), banana trees are water hogs. You might have to water daily, especially during hot weather, to maintain adequate soil moisture. The plants also will need regular fertilization throughout the growing season."
  },
  {
    "id": "2",
    "commonName": "Spider Plant",
    "botanicalName": "Chlorophytum comosum ",
    "image": "",
    "description": "These hardy plants will survive less-than-perfect conditions, and they are stunning when you can mimic their native tropical environment. These plants grow slender, gently arching leaves that can stretch from around 1 to 1.5 feet long on average. The leaves can be green or striped green and white. Mature plants regularly send out long stems that bear small, star-shaped flowers. Once the flowers fall off, tiny plantlets form in their place, which ultimately grow their own roots. Spider plants can typically be planted at any time as long as they are not exposed to frost. They have a moderate growth rate.",
    "watering" : "bi-weekly",
    "difficulty" : "beginner",
    "pets" : " ",
    "light" : "direct",
    "flowering": true,
    "size" : "small",
    "perennial" : true,
    "care" : "Spider plants are often grown in containers as hanging plants due to the cascading nature of their foliage and their long stems with plantlets. They also look great when grown atop columns. If you place their container on something rather than hanging it, make sure the long leaves aren’t getting crushed and the long plantlet stems don’t get so heavy that they pull over the pot. In warm climates, spider plants do well in outdoor planters and as ground cover plants. "
  }
]
