
[
  {
    "id": "1",
    "commonName": "Banana Tree",
    "botanicalName": "Musa acuminata, Musa ornata, Musa basjoo",
    "image": "",
    "description": " While these tropical fruiting plants are commonly referred to as trees, they’re technically huge herbaceous plants, as they don’t have a woody stem. Instead, they have fleshy, upright stalks from which large, oblong, bright green leaves grow. Showy flowers appear typically in the spring, giving way to the fleshy, elongated, green or yellow fruit. While most species grow best in warm climates, there also are somewhat cold-hardy banana trees. Plus, they can make good houseplants with enough light, though they typically don't bear fruit indoors.",
    "watering" : "weekly",
    "difficulty": "medium",
    "pets": ["cats" , "none"],
    "light": "direct" ,
    "flowering": true,
    "size":"large",
    "perennial" : true,
    "care" : "Choosing the right planting site is key to making banana tree care easy. Grow this plant in a location where it will be sheltered from strong winds, as it is very susceptible to damaged leaves. Prepare your planting site by mixing some compost into the soil. And make sure you have enough space for the height and spread of your particular species. During the growing season (spring to fall), banana trees are water hogs. You might have to water daily, especially during hot weather, to maintain adequate soil moisture. The plants also will need regular fertilization throughout the growing season."
  },
  {
    "id": "2",
    "commonName": "Spider Plant",
    "botanicalName": "Chlorophytum comosum ",
    "image": "",
    "description": "These hardy plants will survive less-than-perfect conditions, and they are stunning when you can mimic their native tropical environment. These plants grow slender, gently arching leaves that can stretch from around 1 to 1.5 feet long on average. The leaves can be green or striped green and white. Mature plants regularly send out long stems that bear small, star-shaped flowers. Once the flowers fall off, tiny plantlets form in their place, which ultimately grow their own roots. Spider plants can typically be planted at any time as long as they are not exposed to frost. They have a moderate growth rate.",
    "watering" : "bi-weekly",
    "difficulty" : "beginner",
    "pets" : ["cats", "dogs", "none"],
    "light" : "direct",
    "flowering": true,
    "size" : "small",
    "perennial" : true,
    "care" : "Spider plants are often grown in containers as hanging plants due to the cascading nature of their foliage and their long stems with plantlets. They also look great when grown atop columns. If you place their container on something rather than hanging it, make sure the long leaves aren’t getting crushed and the long plantlet stems don’t get so heavy that they pull over the pot. In warm climates, spider plants do well in outdoor planters and as ground cover plants. "
  },
  {
    "id": "3",
    "commonName": "Boston Fern",
    "botanicalName": "Nephrolepis exaltata",
    "image": "",
    "description": "The Boston fern is a popular fern species that grows in many tropical areas around the world. It is also commonly kept as a houseplant, especially because it doesn’t have high sunlight needs. The foliage of this fern remains evergreen. Its sword-shaped, blue-green fronds with many tiny leaflets are erect and arch as they grow larger. Like several other fern species, the Boston fern is a fairly slow grower and is best planted in the fall or spring.",
    "watering" : "high",
    "difficulty": "med",
    "toxicDogs": false,
    "toxicCats": false,
    "light" : "low",
    "flowering": false,
    "size" : "medium",
    "perennial" : true,
    "care" : "Boston ferns appreciate a little TLC. They like warm and humid conditions. And they don’t enjoy temperature extremes, either outside or from drafts, air conditioners, and heating vents indoors. It’s important to maintain stable growing conditions for Boston ferns, as any element to their care that’s out of whack can quickly damage the plant. Plan to water frequently to prevent the soil from drying out. Fertilize from spring to fall when the plant is actively growing. Regularly misting your fern or using other means to raise humidity also is typically a must unless you live in a very humid climate."
  },
  {
    "id": "4",
    "commonName": "Zebra plant, rattlesnake plant",
    "botanicalName": "Calathea (many sub-varieties)",
    "image": "",
    "description": "The genus calathea includes some of the most beautiful tropical plants in the world, characterized by boldly marked, oblong leaves in a dazzling array of colors. Due to the plant's eye-catching stripes and veining, they're often known by nicknames such as the zebra plant, peacock plant, or rattlesnake plant. Native to Brazil and grown indoors year-round, calathea are true tropicals in every sense of the word, gaining a reputation for being somewhat fussy about their grow conditions. However, once those conditions are maintained, these tropicals will thrive and grow rather quickly, often reaching a mature size of one to two feet tall in a year.",
    "watering": "high",
    "difficulty": "medium",
    "toxicDogs": false,
    "toxicCats": false,
    "light": "low",
    "flowering": true,
    "size" :" medium",
    "perennial" : true,
    "care" : "Calathea have a reputation as greenhouse plants, and it's easy to see why. They're highly sensitive to chilly temperatures and grow best when kept in the warm, humid environment greenhouses often provide. The good news: You don't have to call a greenhouse or glass atrium home in order to care for one of these tropical beauties. As long as you take care to mimic the balmy temps, moisture-packed air, and shady environment calathea love, they can thrive in nearly any household."
  },
  {
    "id": "5",
    "commonName": "Ponytail Palm",
    "botanicalName": "Beaucarnea recurvata",
    "image": "",
    "description": "The ponytail palm makes a surprisingly interesting desktop plant, considering that when grown outdoors it can be a full-size tree that towers over homes. Despite the common name and the appearance of the foliage, this is not a true palm, but rather a member of the Asparagaceae family that includes edible asparagus! Indoors, these novel little trees are often grown in shallow pots, with a tuft of strappy green leaves emerging from a bulbous stem that seems to erupt from the soil. Given time and the right conditions, a small desktop plant will grow into respectable specimen plants, up to 6 feet in height or more. Ponytail palm is native to arid regions in Central America and is among the easiest of small trees to grow indoors.",
    "watering" :"low",
    "difficulty": "low",
    "toxicDogs": false,
    "toxicCats": false,
    "light" :"low",
    "flowering": true,
    "size" : "medium",
    "perennial" : true,
    "care" : "When grown outdoors, it is best planted in a cactus/succulent potting mix and placed in the sunniest spot you can find; in the right location, it is largely trouble-free, provided it gets a modest amount of water at regular intervals. As an indoor plant, the ponytail is basically a ~plant it and forget it~ kind of plant, providing it has enough light to thrive and somewhat steady water throughout the growing season. Keep in mind, though, that the ponytail palm is an extremely slow-growing plant, so don't expect your desktop plant to transform into a corner specimen in one or two growing seasons."
  },
  {
  "id": "6",
  "commonName": "Zebra cactus, pearl plant, star window plant, cushion aloe",
  "botanicalName": "Haworthia",
  "image": "",
  "description": "Haworthias are delightful little succulents that make very attractive small houseplants. Potted plants are often moved outdoors for the summer months, and in regions without frost, they are sometimes grown as garden plants. These small, low-growing plants form rosettes of fleshy green leaves that are generously covered with white, pearly warts or bands, giving them a distinctive appearance. Generally easy to grow, the same best practices that yield healthy aloe and echeveria plants will also produce beautiful Haworthia plants. Like other succulents, these plants appreciate bright light and adequate moisture in the summer, and relatively drier conditions in the winter. Outdoors, these plants generally do best in sheltered locations rather than in full sunlight. Avoid overwatering, but don’t let them dry out too much. Hawthoria plants are generally purchased as potted specimens.",
  "watering": "low",
  "difficulty": "low",
  "toxicDogs": false,
  "toxicCats": false,
  "light": "medium",
  "flowering": true,
  "size" :"small",
  "perennial" : true,
  "care" : "Haworthia are very easy to grow. As with all succulents, the most dangerous situation is too much water, since they should never be allowed to sit in water under any circumstances. At the same time, these little decorative plants can be grown in interesting containers such as teacups and even miniature baby shoes. If you've given a Haworthia in such a container, make sure the container had adequate drainage. If it doesn't, it might be a good idea to pop the plant out of its container and add a layer of gravel to the bottom to reduce the wicking action of the soil above. Finally, look out for sunburned spots on your plants."
},
{
  "id": "7",
  "commonName": "Bird of Paradise",
  "botanicalName": "Strelitzia Plant Profile ",
  "image": "",
  "description": "Surprisingly, the bird of paradise is easier to grow than many tropical plants and makes for a vigorous, rapidly growing indoor plant. It can be moved outside in the summer, and in warmer climes, it thrives for half the year outside. Bird of paradise typically flowers in the late winter or early spring, but under optimal conditions, it flowers at other times. These plants grow with upright leaves emerging directly from the soil; there is no trunk. The large leaves range from 12 and 18 inches long, and they can shred when exposed to windy conditions or when brushed in a busy hallway.",
  "watering" : "low",
  "difficulty": "low",
  "toxicDogs": true,
  "toxicCats": true,
  "light": "high",
  "flowering": true,
  "size": "large",
  "perennial" : true,
  "care" : "The trick to successful growth indoors is providing lots of bright light with some direct sun, regular watering, and warmth. Feed the plant with compost early in spring before new growth begins, and then fertilize every week or so during the growing season. For the best chance of survival, grow the plant in a container that can be moved outside in warm summer months and brought back inside for winter. To bring the plant to bloom once it is four to five years old, keep it pot-bound. Give it plenty of sun and feed it on schedule. Note: The plant is mildly toxic to dogs, cats, and people, but it takes eating quite a bit of it to have an effect."
},{
  "id": "8",
  "commonName": "Fiddle-Leaf Fig",
  "botanicalName": "Ficus Lyrata",
  "image": "",
  "description": "The fiddle-leaf fig is a popular indoor specimen plant featuring very large, heavily veined, violin-shaped leaves that grow upright. These plants are native to tropical parts of Africa, where they thrive in very warm and wet conditions. This makes them somewhat challenging for the home grower, who is likely to have trouble duplicating these steamy conditions. However, they are relatively tough plants that can withstand a less-than-perfect environment for a fairly long time. Fiddle-leaf figs are perfect as focal points of a room if you can situate them in a floor-standing container where the plant is allowed to grow to at least 6 feet. (Most indoor specimens reach around 10 feet tall.) They’re fairly fast growers and can be potted at any point in the year if you're like most gardeners acquiring a nursery plant to keep indoors.",
  "watering": "low",
  "difficulty" : "medium",
  "toxicDogs": true,
  "toxicCats": true,
  "light": "high",
  "flowering": false,
  "size" :"large",
  "perennial" : true,
  "care" : "Fiddle-leaf figs are not especially demanding plants as long as you can get their growing conditions right. When grown as a houseplant, be prepared to rotate your fiddle-leaf fig every few days so a different part faces the light source. That way, it will grow evenly, rather than lean toward the light. Also, every week or two dust the leaves with a damp cloth. Not only does this make the leaves appear shinier and more appealing, but it also allows more sunlight to hit the leaves for photosynthesis. Moreover, you can trim off any damaged or dead leaves as they arise, as they no longer benefit the plant. And if you wish, you can prune off the top of the main stem for a bushier growth habit."
},{
  "id": "10",
  "commonName": "Monstera, Swiss Cheese Plant",
  "botanicalName": "Monstera Deliciosa",
  "image": "",
  "description": "Native to the rainforests of Central America, the Monstera deliciosa plant is also known as the ~tropical split-leaf philodendron~. This climbing evergreen is a popular easy-to-grow houseplant and a favorite of many interior designers for both residential and commercial spaces. Indoors, the plant grows about two feet high, its leathery, glossy, characteristic split and heart-shaped leaves coming from intricate aerial roots, which can be used for ropes and basket making. It is also called Swiss cheese plant due to the perforated leaves, which can grow up to three feet long and are significantly larger than the related petite variety M. Adansonii. Monstera deliciosa thrives in high humidity, produces tan-cream flowers pollinated by bees and bears edible juicy fruit with the combined flavor of pineapple and banana. Fruiting is not common in houseplants.",
  "watering" : "low",
  "difficulty": "low",
  "toxicDogs": true,
  "toxicCats": true,
  "light" :"medium",
  "flowering": true,
  "size": "large",
  "perennial" : true,
  "care" : "If intended as a houseplant, choose a deep pot with many drainage holes. Fill the bottom third with peaty potting soil and establish a stake gently for the stem to climb on. Set the roots into the container. Fill with soil around the roots. Firmly surround the stake with soil and use plant ties to attach the stem to the stake. Every two years or so, the Monstera deliciosa will likely outgrow its pot. Transplant into a pot a few inches wider and deeper."
},{
  "id": "11",
  "commonName": "Rubber Tree (several varieties)",
  "botanicalName": "Ficus Elastica",
  "image": "",
  "description": "Ficus elastica, also known as the rubber plant, is an unusual-looking varietal native to the tropics of Southeast Asia. It boasts oversized, oval-shaped leaves that are a rich emerald hue, and can grow quickly, reaching up to 100 feet tall in its natural habitat. However, it's more often grown indoors as a houseplant, where it can be planted and cared for year-round and its size kept more manageable. When it comes to caring for a rubber plant, your job is pretty straight-forward. Simply give it enough light, water, and warmth (it is a tropical plant, after all), and you'll be rewarded with an exotic addition to your indoor plant collection.",
  "watering" : "medium",
  "difficulty": "medium",
  "toxicDogs": true,
  "toxicCats": true,
  "light": "medium",
  "flowering": false,
  "size" : "medium",
  "perennial" : true,
  "care" : "While rubber plants are a pretty hardy varietal, they do have a few specific care requirements in order to find the right balance in their environment. That means providing lots of light, moist (but not soggy) soil, and enough fertilizer to keep it healthy. The rubber plant has waxy-looking leaves that start out a pink-coral hue, eventually deepening to a dark rich green. As the rubber plant grows it will begin to droop, so it's important that you help support them by using a long wooden dowel (or bamboo stalk) to help keep them upright. They can tolerate soft morning sunlight but should be moved out of the line of harsh direct rays in the afternoon as they can singe the leaves. Plants that do not receive sufficient light will become leggy, lose their lower leaves, and their leaf color will become dull instead of glossy and vibrant."
}
]